import { CHANGE_FATCA } from "../types";

const init = {
  fatca: [
    {
      title: "ท่านเป็นพลเมืองอเมริกัน ใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านเป็นผู้ถือบัตรประจำตัวผู้มีถิ่นที่อยู่ถาวรอย่างถูกต้องตามกฎหมายในสหรัฐอเมริกา (เช่น กรีนการ์ด) ใช่ หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีสถานะเป็นผู้มีถิ่นที่อยู่ในสหรัฐอเมริกาเพื่อวัตถุประสงค์ในการเก็บภาษีของสหรัฐอเมริกา ใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านเกิดในสหรัฐอเมริกา (หรือดินแดนที่เป็นของสหรัฐอเมริกา) แต่ได้สละความเป็นพลเมืองอเมริกันอย่างสมบูรณ์ตามกฏหมายแล้ว",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีคำสั่งทำรายการโอนเงินเป็นประจำโดยอัตโนมัติจากบัญชีที่เปิดไว้หรือมีอยู่กับกลุ่มธุรกิจทางการเงินธนาคมรกสิกรไทยไปยังบัญชีในสหรัฐอเมริกา ใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีการมอบอำนาจหรือให้อำนาจการลงลายมือชื่อแก่บุคคลที่มีที่อยู่ในสหรัฐอเมริกา เพื่อการใดๆ ที่เกี่ยวข้องกับบัญชีที่เปิดไว้หรือมีอยู่กับกลุ่มธุรกิจทางการเงินธนาคารกสิกรไทย ใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีที่อยู่เพื่อการติดต่อ หรือดำเนินการเกี่ยวกับบัญชีที่เปิดไว้ หรือมีอยู่กับกลุ่มธุรกิจทางการเงินธนาคารกสิกรไทยแต่เพียงที่อยู่เดียวซึ่งเป็นที่อยู่สำหรับรับไปรษณีย์แทนหรือที่อยู่สำหรับการส่งต่อ ใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีที่อยู่อาศัยในปัจจุบัน หรือที่อยู่เพื่อการติดต่อในสหรัฐอเมริกา สำหรับบัญชีที่เปิดไว้หรือมีอยู่กับกลุ่มธุรกิจทางการเงินธนาคารกสิกรไทยใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    },
    {
      title:
        "ท่านมีหมายเลขโทรศัพท์ในสหรัฐอเมริกา เพื่อการติดต่อท่านหรือบุคคลอื่นที่เกี่ยวข้องกับบัญชีที่เปิดไว้หรือมีอยู่กับกลุ่มธุรกิจทางการเงินธนาคารกสิกรไทยใช่หรือไม่",
      choice: ["ใช่", "ไม่ใช่"]
    }
  ]
};

export default (state = init, action) => {
  switch (action.type) {
    case CHANGE_FATCA:
      return { ...state, [action.key]: action.value };

    default:
      return state;
  }
};
