import { CHANGE_FATCA } from '../types'
const init = {
  fatca: [
    {
      title: 'ท่านเป็นพลเมืองอเมริกัน ใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านเป็นผู้ถือบัตรประจำตัว ผู้มีถิ่นที่อยู่ ถาวรในสหรัฐอเมริกา ใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านมีสถานะเป็นผู้มีถิ่นอาศัยในสหรัฐอเมริกาเพื่อวัตถุประสงค์ในการเก็บภาษีของสหรัฐอเมริกา ใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านเกิดในสหรัฐอเมริกา (หรือดินเเดนที่เป็นของสหรัฐอเมริกา) เเต่ได้สละความเป็นพลเมืองอเมริกันอย่างสมบูรณ์ตามกฏหมายแล้ว',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านมีคำสั่งทำรายการโอนเงินประจำโดยอัตโนมัติจากบัญชีที่เปิดไว้กับกลุ่มธุรกิจการเงินของ SCB ไปยังบัญชีในสหรัฐอเมริกาใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านมีคำสั่งทำรายการโอนเงินประจำโดยอัตโนมัติจากบัญชีที่เปิดไว้กับกลุ่มธุรกิจการเงินของ SCB ไปยังบัญชีในสหรัฐอเมริกาใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านมีที่อยู่อาศัยในปัจจุบัน หรือที่อยู่เพื่อการติดต่อในสหรัฐอเมริกา สำหรับบัญชีที่เปิดไว้กับ กลุ่มธุรกิจการเงินของ SCB ใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    }, {
      title: 'ท่านมีหมายเลขโทรศัพท์ในสหรัฐอเมริกา เพื่อการติดต่อท่านหรือบุคคลอื่นที่เกี่ยวข้องกับบัญชีที่เปิดไว้กับกลุ่มธุรกิจการเงินของ SCB ใช่หรือไม่',
      choice: ['ใช่', 'ไม่'],
    },
  ]
}

export default (state = init, action) => {
  switch (action.type) {
    case CHANGE_FATCA:
      return { ...state, [action.key]: action.value }
  
    default:
      return state
  }
}